{"pages":[{"title":"categories","text":"categories: -[Java, Servlet] -[Programming]","link":"/categories/index.html"},{"title":"tags","text":"","link":"/tags/index.html"},{"title":"about","text":"","link":"/about/index.html"}],"posts":[{"title":"MapReduce","text":"","link":"/2019/08/11/MapReduce/"},{"title":"Java垃圾回收GC","text":"Java 垃圾回收机制Gabage Collection在java中，内存动态分配和垃圾回收由JVM来处理。 什么是根节点？比如， Person person = new Person();person.car = new Car(RED);person.car.engine = new Engine();person.car.horn = new AnnoyingHorn();有四个对象：person, car, engine, horn, 画图如下所示 Person [p] | Car (red) / Engine AnnoyingHorn And you’ll end up with Person at the “root” of the tree. It’s live because it’s referenced by a local variable, p, which the program might use at any time to refer to the Person object. This also goes for the other objects, through p.car, p.car.engine, etc. Since Person and all other objects recursively connected to it are live, there would be trouble if the GC collected them. Consider, however, if the following is run after a while: p.car = new Car(BLUE);And redraw the graph: Person [p] | Car (blue) Car (red) / Engine AnnoyingHorn Now the Person is accessible through p and the blue car through p.car, but there is no way the red car or its parts can ever be accessed again - they are not connected to a live root. They can be safely collected. So it’s really a matter of taking every starting point (every local variable, globals, statics, everything in other threads and stack frames) — every root — and recursively following all the references to make up a list of all the “live” objects: objects which are in use and unsuitable for deletion. Everything else is garbage, waiting to be collected.","link":"/2019/08/11/Java垃圾回收GC/"},{"title":"Speaking","text":"Speaking Part 1: simple answer + reason(1) self-introduction: 2-3 introduction questions Do you work or are you a student? I am a big data engineer in Huawei. My major is computer science. Do you enjoy your job or studies? Yes, I enjoy my work very much. There are so much new stuff to learn every day, and it’s really fun for me. Would you like to get a different job in the future. No, I am really happy with the career I’ve chosen, so I have no plans to change jobs, but maybe I will study phd while I am working. What is your favorite color? My favorite color is red, because it’s the color for happiness. It is always used for the New Year or other happy occasions. (2) 4 questions about one topic Lets talk about sport. do you like sport? do you think it is better to watch sports or play them yourself? why do you think some sports are so popular? First, most sports such playing basketball or football are very beneficial for people’s health. People in the modern life barely have time to excercise themselves too much as before. For example, when they go outside, they would drive or take the subway. If they are hungry, sometimes they would just order takeouts and the food will be sent in front of them. So doing sports it’s a very good way to help people stay healthy. Also, it is a very good way to communicate with others. Do you think children should all have to do sports at school? Lets talk about colors? What’s your favorite color? Why? Do differnt colors have differnt meanings in your country? Do you think the color can affect the way people feel? Do you wear different colored clothes now compared to when you were a child? Part 2 (4 mins) - Describe: a short presentation with 1 minute preparation(1) Describe a person (who): who, how, where, when, why My brother is hard-working. I remember when he was a Phd student, he always stayed up to 1 or 2 o’clock in the morning to prepare his paper.hard-working, a great sense of humor, Describe someone you konw who does something well. I am going to describe a friend of mine, called Kile. I met him in university, we were taking the same class and he always sit next to me. He is in the same major as I do. The reason why I think he is good. Well, I think it comes from his work. He is really hard-working. (2) Describe a place (where): farmers’ marketfresh, cost-effective,an interesting placean unforgettable experience that I enjoyed every minute. the service was excellentinviting, polite 优胜美地we visited famous landmarks and attractions, such as …we lost track of time because we were enjoying ourselves so much. restaurantthe restaurant is friendly, the waiters really made us feel special. They even surprised us with a birthday cake for one of my friend whose birthday was that day. a river what kind of foodThere are a variety of food choices on the menu.It is a great chance to get together with friends and chats about what we have been up to.catch up with some of my good friends.but also, the restaurant itself is really nice, the service was fantastic. the waiters and staff really make you feel at home.and we were really surprised at the end when they brought us a cake to celebrate my friends’ birthday. (3) Describe an object (what): my laptopfeatureskindlea gift,portableprotect my eyes.if I am in the bus, or waiting for someone (4) Describe an event (what):New Year (5) Describe an activity (what): (6) Describe your favorites (what):Part 3 -when I want to kick back and relax, I usually turn on the TV and play some music.If it’s rainy outside, I will just put my feet up and read a book. 坐下来看本书，好好休息一下 New Zealand’s breath-taking natural beauty attracts hundreds of thousands of visitors every year. To young people, it is. The economy of my hometown is booming. Tons of job opportunities are provided due to the industrial and commercial development there. Young people can easily find their positions in this city. Furthermore, there are also many places for entertainment like the pubs, cinemas, theaters and so on. However, I do not think it’s a good place for the senior. With the development of the local industries, environmental pollution has become more and more severe in recent years. I’m afraid it’s really bad for old people’s health, especially to those sick ones. The most important thing you gain when you learn a language is that you establish what is called a bridge between your mother tongue and the target language. This bridge is essential in communication and mutual understanding among diverse nations and varied cultures. When you learn a certain new language you will soon find out that you expose yourself to a different culture, a different method of thinking and a different heritage. This brand new concept will give its contribution to widening your scope of knowledge and helping you to become more flexible and resourceful. Your character will have another great alternative foundation on which you can rely to solve a lot of problems. You will have a wonderful time walking in various fields and smelling novel flowers. With language, we can express our hopes, desires, dreams and fears. With language, we can pass our knowledge, experience, skills and points of view. That’s why we can say that when you learn a new language, you double the benefit of your life time as you win another life!A major example for demonstrating this bridge is late Egyptian president Anwar Al-Sadat. Not only was Al-Sadat a great leader but he was also a brilliant linguist (He spoke more than 5 languages).This made him greatly tolerant and understanding towards the other cultures. While he was responsible for breaking out war between Egypt and Israel again, he, with his partners, managed to reach the durable Camp David Accords which ended war between the two countries up till now and saved thousands of lives. Through his initiatives, he taught a lot of people how to take significant steps towards peaceful coexistence and reciprocal appreciation. He couldn’t have done so without his profound knowledge of other languages. He properly used this lingual bridge to conceive the others’ attitude and to convey his perspective to them. Sure he learnt that when you can’t dictate your conditions, you should negotiate and do something like give and take without violating your constant values. I can’t imagine that he reached this ability without navigating in literature and spending good deal of his precious time with remarkable names like Shakespeare, Dickens and Arthur Miller. He was exceptionally interested in history but it is completely another thing when you read history from another point of view. No wonder he could figure out a lot of dilemmas. INFORMATIVE &amp; LOGICAL [ ] what do you usually do during weekends?well, I usually do some exercise during weekends. I go hiking every two weeks. last week I went to Big Basin Redwood state park in Saratoga, California. Hiking is a really good way to stay healthy and fit, especially for people like me, who have to sit in front of computer and do programming five days a week. Also, I can make a lot of new friends during hiking. So even though it’s tiring, I really enjoy hiking. But if it’s rainy, I would just put my feet up and read a book. [ ] Do you prefer Saturdays or Sundays, why?I prefer Saturdays. For Saturdays, I can plan for a one-day or two-day trip. But Sundays are the end of the weekend and I need to prepare for Monday’s weekly meeting. Also, I can stay up very late to watch a movie or read a book However on Sunday evenings I have to go to bed early since I need to get up very early the next morning. So I would say Saturdays are better than Sundays. [ ] Do the old and young have the same weekend activities? Why or why not?I don’t think so. Most young people are stressed out from work, they usually go hiking or take a trip to chill up themselves. However, considering the senior’s physical conditions, it’s unlikely for them to be involved in some outdoor activities, like hiking, Marathon or skating. Also, Most old people are retired, so their weekends almost mean the same to them just as weekdays. [ ] What is your hobby? (who + when + where + why + how)My hobby is shopping. I usually go shopping when I am free, especially during weekends. Every time after buying a lot of clothes back, I feel so excited and cannot wait to try them on again. Even though sometimes I just do window-shopping, I still feel good. My favorite shopping place is outlet, where the products are cheap and cheerful. I have to say shopping is the best way to relax myself and it’s really amazing. [ ] Say something about your hometown?I came from China. My hometown is Guangshui, located in the middle part of China. it’s about 2 hours by flight to Shanghai. Guangshui has four very distinct seasons. It’s freaking cold in winter to the point that the wind can really chill me to the bone, while summers are always as hot as hell. However, surrounded by mountains and rivers, it’s a really gorgeous place especially in autumn, when golden hillsides cascade into sparkling rivers. Right now I really miss the breath-taking natural beauty of my hometown. [ ] what’s your hometown popular for?My hometown Guangshui, in Chinese, it means town of water. As you can see from the name, it’s popular because there are a lot of rivers across the town including a branch of Yellow River. When I was young, in the summer evenings, almost all the families in the town went to swimming in the river. Bach then, the water was so clean to the point that we could directly drink it. However, because of pollution, all the rivers have been turned color. [ ] what do you like most about your hometownMy favorite is dim sum. In my hometown, people always have their breakfast outside, where there are a lot of stands for different kinds of breakfast, like pan-fried dumplings, porridge of different flavors, and soup noodles. It’s very similar to a farmer’s market. Just that they serve dim-sum instead. Every morning around 9:00 am, people would gather in the downtown to have their breakfast and start their day of work after that. [ ] Do you think your hometown is a good place for young people?Honestly, I do not think so. It’s a really rural place, where young people can hardly find a good job. Also, the lifestyle in my hometown is very slow and relaxing. it’s better for young people to step out of the comfort zone and go to big cities like New York, Shanghai where there are a lot of competitions. Only in that way they can improve themselves to a higher level. [ ] How do people make a living there?Most people in my hometown farm for a living. Because there are a lot of lands that are good for growing vegetables and rice. For example, my parents cultivated a lot of tomatoes, cucumbers and cabbage. It’s also because that most people learnt farming from the older generations and that’s basically the only thing they are confident with. People can not profit much from Agriculture, but at least it can cover their daily expenses. Unlike people from big city, farmers are not crazy for luxury brands. [ ] How long have you been living in your hometown?I lived there until I was 18, when I went to college in a big city. It’s always the most holy place in my heart. It’s the place always reminding me of the happy time when I was a kid. [ ] Do you like eating fruits, why?Yes, I love fruits very much. I basically eat fruits every day. Sometimes I take bananas and apples as breakfast. Firstly, fruits are rich in vitamins, fibers and water, which is good for us to stay healthy. Secondly, after a day of work in front of computer, it’s really relaxing and exciting to see so many fruits of different colors on the table. I like oranges, kiwis, apples, mango, all of them together is really colorful. [ ] What’s your name?My Chinese name is Chunli Yu, you can call me my English name Emma. Chunli is my given name, it means prosperous spring. Since I was born in Spring, my mom hope my life would be as prosperous as spring. I can be as tough and optimistic as trees. [ ] Are you studying or working?I am working at Aetna, an insurance company. I am a data engineer in the data science team. It’s been two years since I started working. [ ] What do you do during your job?Most of my projects are to extract insurance data from different sources, so that the data sets can be analyzed more efficiently in our platform which is Spark. I actually automated this process including data extraction, cleansing, and normalization by writing python scripts. We also talked a lot to the business team, to help them make decisions based on insight from our analytic results. [ ] what is your favorite subject when you were in the middle school?My favorite subject was classical Chinese. The main reason I like it so much is because the classical Chinese is really efficient. The articles in classical Chinese are always around 100 words. To express the same meaning, it costs 1000 words in modern Chinese. Besides, in the old time, Chinese articles are taken as songs. So most of the sentences follow the similar rhythm and rhyme. Even though the classical Chinese is very hard to understand, I still think it’s amazing. [ ] What’s your major?My major is computer science. I got both my master’s degree and bachelor’s degree in Computer science. I also did a minor in Japanese, which is a good addition to my engineering study. [ ] Do you like your major, why?I do, I feel so lucky that I chose computer science. I did not have much access to computers before going to college because I could not afford it. Computer to me is just like candies to a kid who do not have money to buy it. That’s also the reason why I value a lot this opportunity to study computer science. I ranked second in my major when graduated. Not only it makes me more confident, But also it help me get a good job which can support me quite well. [ ] Do you want to change for another job?Yes, I am actually thinking about it. My current job is very cozy and coworkers are very nice. We always hang out and have a drink after work. However, based on some coworker’s experiences in my department, it’s very hard for me to get promoted and gain much progress in the next ten years. I want to get a more challenging job in a startup so that I can take on more responsibilities and grow faster. [ ] What do you usually do everyday?Most time I was working in the office. I am not an early bird and get up at around 8:00am, then I make myself a cup of coffee and go to work. I always have lunch in the cafeteria inside the office building. evenings are my favorite part of one day. I get back home at around 5:00pm, then I usually do yoga for half an hour, call my friends or family, then make a dinner. After that I just put my feet up and watch some videos. [ ] Is there anything you like to do everyday?Yes, I do yoga every day, not quite long. It’s a really good way to refresh myself after a day of work. Also, it helps me keep fit, my body is more flexible than before. [ ] Do you do housework?Yes, I do. Ever since I was a little girl, I did a lot of housework including cleaning the room, do the laundry and wash the dishes. Because my mom was always busy and tired, I really enjoyed doing housework to ease her burden. Also, I got the habit of organizing stuff and took good care of myself. When I went to college that was far away from home, I could adjust the new environment pretty fast. Doing housework is actually a way to relax myself. [ ] What changes are brought into housework by modern technology?Obviously a lot, to me, there are three modern technologies that really make my life easier. One is washing machine, when I was young, all my family’s clothes were hand washed, which was really tiring and time-consuming. The second one is dish washer, every time after dinner, I would just throw all the dirty dishes to the washer and throw myself down on the sofa. The third one is vacuum cleaner. DYSON V8 is my favorite. it’s very light and wireless. So we do not need to plug in and plug out when we change rooms. Even though it’s kind of expensive, like around $250, I would still highly recommend it because it’s worth the price. In these situations, modern technology is really fantastic. [ ] What is your future plan?I am planning to relocate to Canada. As an international student, it’s really hard to get the green card in United States no matter how much I like this place. My home country China, is developing rapidly, especially in the fields of computer science. However, there are still some bias towards women. For example, they would call girls like me left-over ladies just because I do not have a boyfriend at this age. They prefer to hire a male in the workplace. Since Canada has similar culture as United States, I would like to relocate to Canada. [ ] To what extend do you think that people should always have future plans?My opinion is that people should always have future plans. If they have a big picture about their life, people tend to be more optimistic and self motivated. Without plans, one will certainly be quite passive when confronting some accidents or unhappy moments. So it’s advisable for every one to plan ahead. [ ] Can you speak any other language besides English?Except for English, I can also speak Japanese. I did a minor in Japanese during my bachelor’s study. I passed the Japanese N2 Language test, which is the second highest test for Japanese learners. Just like Band 8 in IELTS. But I have not spoken Japanese for 4 years, it will take time for me to pick it up. [ ] How important is it for people to master several second languages?I think it’s very important to master at least one second language. As we know, language is the bridge to other cultures. It’s very essential in communication and mutual understanding among diverse nations and varied cultures. When we learn a certain new language we will find ourselves exposed to a different culture, a different way of thinking and a different heritage. This brand new concept will help widen our scope of knowledge and open our mind. Therefore, mastering several second languages including English is quite necessary for people, particularly for younger generation. [ ] What kind of clothes do you like most?I like sports clothes very much, especially those dry-fit ones. I always go hiking during weekends and practice yoga in evenings. Sport clothes are really flexible and comfortable for doing exercises. Besides, it’s very easy to take care of, I can just throw them to washing machine instead of hand wash. What’s more, the sports clothes are always in the trends, unlike other kind clothes, even after 5 year, it’s still stylish to wear sports clothes. [ ] What clothes are more popular in your country now?It’s been a long time since I came here, so I am not quite clear about the fashion trend in China. From the pictures posted on social medias like wechat, instagram, I think Chinese people are really into sports clothes. The brands they like most are Nike, New Balance and Adidas. I think that’s a big progress, it shows that people care more about how comfortable the clothes are and tend to work out more than before. [ ] What do you pay more attention to when buying clothes, the price, quality or brand?I care more about the price and quality when playing an order for clothes. There is no doubt that brand clothes usually have better quality and more stylish. If I am rich enough, I would browse in the shops with big names. Sometimes I go shopping in outlets for clothes that are cheap and cheerful. （物美价廉） [ ] Do you like shopping?Yes, definitely. Shopping is a really good way to relax myself. Every time after buying a lot of clothes back, I feel so excited and cannot wait to try them on again. Window-shopping is fun too, I can keep track of the fashion trend. However, I am not into net-shopping for clothes because it’s really hard to tell if the product is as good as showed in the picture. Even though more people think online-shopping is more convenient, I still think solid shopping is a better experience. [ ] Where do you go shopping? with whom?I always drive to outlet for shopping. The main reason is that the products there are usually cheap and cheerful. For example, last weekend I bought a sweater with 20 bucks. Outlets are located outside of the city, where it’s easier to find a parking lot. Unlike most people they like to shop together, I always go shopping by myself. I browse around very quickly while my friends enjoy looking around slowly. I am into sports clothes while my friends prefer some clothes that are more girly, like dresses. I like to go to outlets while most of my Chinese friends like to shop in big malls with luxury brands inside. So it’s just easier for me to go shopping alone in outlets. [ ] Do you usually go shopping in one place or in different places?It depends what I intend to buy. If I need to buy some clothes, I would go to outlet or Nordstorm Rack. When I need to buy vegetables, I would go to farmer’s market or target. There is a target near my place, I frequently go there. In the case I need cosmetics, I just shop online. [ ] How often do you go shpping?It all depends whether I am busy or not. If I am working on some urgent projects, I may focus on my work and go shopping three months later. Otherwise I go shopping every month. [ ] What is your favorite food?My favorite food is [ ] What do you think about fast food?I like fast food, especially in-n-out. the food served there is very fresh and there are always people waiting in the line. Compared to eating in fancy restaurants, fast food is more cost effective. we can have a rich lunch with less than $10. Also, it’s faster than dinning in big restaurants. we can just drive through and leave with food we ordered. it’s really convenient. unhealthy as it is, I still like fast food because it’s cost-effective, time-saving and tasty. [ ] Do you cook?Yes, but just cook for myself. Without discussion, my family and my friends have the totally same opinion on the food I cooked. They said disgusting. Sometimes to make me feel better, they would say: eatable. They will try any means to stop me cooking. [ ] Do you have breakfast everyday?Not really. I am not a morning person and get up at around 8:00am. Then I go to work with a cup of coffee and a piece of bread. If time permitting, I will make myself a fried egg. [ ] How important is breakfast?Breakfast is surely very important for people. Firstly, a good breakfast can offer the necessary energy and nutrition people need for the whole morning. What’s more, if people do not have breakfast for a long time, they may probably get sick. Finally, some people do not have breakfast but eat more at lunch, it’s easy for them to gain weight. And that’s really bad for their health. [ ] Why don’t some people have breakfast?Some people get up too late and there is no time left for them to have breakfast. Also, some people prefer to work out in the morning, It’s better for them not having breakfast before they do exercise. And they probably do not have any appetite to eat after working out. [ ] Do you live in a flat or a house?I am staying in a house that is 3-floor. The first floor is the garage, Dining room and living room are on the second one. bedrooms are located on the third floor. My room is a guest room. [ ] How many Chinese families living in the house?including me, there are 3 people in the house. [ ] What can you see from the window of your room?Looking out of my window, on the left is a local highway. In the center is a 2-floor office building that is for government use. there is a railway station on the right. The location is not that good because house prices in California is really expensive. As you can imagine, it’s very noisy with windows open. In the beginning, I could not fall asleep because of the siren of the train and the sound of driving cars. After I get used to the noise, I prefer to sleep with the windows open. [ ] What are there on the walls of your room?Since I just moved in, I have not decorate it too much. I am thinking put a picture on the wall to my bed . [ ] Do you have a garden?Not, not yet. I do want to buy a house with a garden. [ ] How many Chinese people have gardens?A few of them have. If they live in the rural places, [ ] What do people usually plant in gardens? [ ] Have you planted anything before?Not, I have not yet. But I do want a garden and plant some flowers after I own a house. [ ] What modes of transportation are popular in your hometown?Buses are the most common way for commuting in the public transportation system. Firstly, it’s pretty cheap to take a bus. Only 1 dollor or 2 dollar you can buy a one-way bus ticket. Secondly, the time is really flexible. Unlike trains, the bus comes every 10 minutes. [ ] Which one is your favorite?I like to take a bus. Firstly, it’s relatively safer. There have been a lot of reports about kidnapped girls by taxi. As more people on the bus, if anything happens, I can call for help at least. Secondly, it’s more economical. [ ] What do you think about public transportation?public transportation is the main part of the city transportation. It’s beneficial for the environment and it’s a cheaper option for commuting to work. People can get to the destination by spending only very little money and without worrying about parking. However, public transportation has some shortcomings; like that the vehicles are over-crowded during the rush hours and quite time-consuming. [ ] Are there any traffic problems in your city?Yes, especially during spring festivals. The street is packed with cars and people. Either part cannot move at all. cars are beeping and people are complaining. With the development of the local economy, more and more people have purchased their own cars while the roads are not wider. To my opinion, it’s really not necessary for most Chinese people to have cars. Because the public transportation is really convenient and affordable in China. Most people buy cars just trying to show off. Just like most people are on fire for brands. Sometimes they are not aware of what they really need. It’s part of the side effects of the rapid development after all. [ ] Do you like watching films? [ ] What do you usually do to get relaxed?I always do shopping to relax myself. I usually go shopping when I am free, especially during weekends. And I like to go to outlets, where the products are cheap and cheerful. Sometimes I can find really stylish clothes there, sometimes I just browse around. I have to say shopping is the best way to relax myself and it’s really amazing. [ ] What do most people do to get relaxed?Most people play Mahjong to relax themselves. It’s a cultural tradition and more than 80% of Chinese people know how to play it. In my hometown, people are so into it that almost each house has an automatic Mahjong table. Playing Mahjong is beneficial for the old people. On one hand, Mahjong plays an important role in helping the senior to remain socially connected. On the other hand, Mahjong is based on math, Mahjong is based on math and a smart game that can help the old generation stay active and avoid Alzheimer disease. [ ] What’s the difference between the ways of relaxation today and ten years ago?Ten years ago, people visited each other and chat with other people face to face a lot while nowadays people play mahjong a lot and travel around to relax themselves. Take my experience as an example, ten years ago, whenever my mom had time, she would bring me to visit my aunties and neighbors. with the development of the local economy, more and more people can afford the flight ticket and enjoying traveling around. My parents like to visit different places. when they are at home, they usually play mahjong. [ ] Do you like traveling?Yes, absolutely. Traveling is a good way to relax myself. The stress of work and daily demands can distract us from what is actually meaningful and interesting. Taking a break from the daily hustle and bustle is essential for your mind to refresh, recharge and rejuvenate. It also helps widen my scope of knowledge and open my mind, making ourselves more aware and open to new things. Whenever I have a long weekend, I will pack my stuff and go for a trip. [ ] Where do you usually go to travel? [ ] When and where was your last traveling? [ ] What do you usually do on vacation?Traveling is the first choice if time permits. [ ] How do Chinese people spend their vacations? [ ] How important are vacations to people’s lives?Vacations mean a lot to everyone. it is a good way for people to relax themselves. The stress coming from work and daily demands can distract up from what is actually meaningful and interesting. Taking a break from the daily hustle and bustle is essential to our mind to refresh, recharge and rejuvenate. [ ] Say something about festival that is most popular in your countryThe most popular festival in China is Spring Festival, also known as Chinese New Year. People usually get at least 7 days off work. It is the time for the whole family to reunite together, which is similar with Christmas Day to the westerners. This festival used to be observed to fight against the monster “Nian” who liked to eat children and livestock. The monster is afraid of red color and loud sound. Therefore, people decorated their houses in red and set off fireworks to scare it away. That’s also the reason why people give out the red-pocket money to their children so that the monster dare not to approach their kids. [ ] Do people in China also celebrate western festivals.Yes, they do. Festivals like Christmas and Thanksgiving, are also celebrated in China. However, most of them are taken as valentine’s day. People give out chocolate and flowers to their boyfriends or girlfriends. Also, those festivals are used to boost sales. Like Christmas is also known as shopping day, because there are a lot of discounts going on. Like buy one get one for free or 30% off. Christmas is as popular as New Year, however, there are not many Chinese people who are Christians. [ ] What kind of film do you like best?When I was young, I like to watch romance movies, which is all about sweet love. As times goes by, I prefer the realistic movies, which talks about humanity. To my understanding, life is about fight, forgive, love and live. [ ] Do you prefer to watch at home or at cinema?Personally, I prefer to watch at home. Firstly, it’s very cost effective. I am a member of Amazon Prime, some movies with high quality are free. I can also watch some free ones on Youtube. Secondly, it’s really convenient to watch at home. I do not drive for around 15 minutes to the theater and watch it based on the schedules of a specific movie. However, when I hang out with friends, I really enjoying watch movie in the cinema. [ ] Do the old people and young people like the same kind of film?I do not think so. Most old generations like historical films. And young people are more into sci-fi movies and action films. [ ] When do you usually watch movie?I usually watch movies on Friday night or Saturday night. [ ] Who is the actor or actress you like most? [ ] What type of music do you like best?I like light music. When I am working, I get used to have music on as white noise. [ ] Can you play any musical instrument?It’s a great pity that I cannot play any musical instruments, but I really admire people who can play the piano. When people are playing the piano, they always look so elegant and cool. So I would like to learn if time permits. [ ] Who is your favorite musician or singer?My favorite singer is Taylor Swift. Most of her songs are really my cup of tea. I esEven though there are a lot of gossip about her, I still like her a lot. [ ] Have you ever been to a concert or musical performances?Yes, I have. I went to Sting&amp;Gwen at AT&amp;T park in Sanfrancisco in 2016. I got so excited when my manger give me the ticket when he could not go. I went to the concert although it was a weekday and the concert started at 7:00pm. The whole stadium was filled with excited fans waiting for the showing up of Sting. CEO of oracle walked onstage first and introduced Sting, who quickly opened with “If I ever lose my faith in you”. Later on, Stefani joined and sing the classic police song “Message in a bottle”. The show lasted for about 3 hours with the screening and yelling of the audience. It was really an amazing experience. [ ] Do you like taking photos?Yes I do, especially when I am on travel. [ ] Do you like to keep old photos?Sure. Old photos are things reminding me of the past and happy moments. [ ] Do you like drawing [ ] Do you think a child should learn how to draw?It’s a good way to build up nice taste of art for children to learn drawing at an early age. [ ] Do you like dancing?I like but I am really not good at dancing. When people are dancing, they look so elegant and cool. So I would like to learn if time permits. [ ] What dance is popular in your country?Recently public square/plaza dancing is really hot in China. It’s becoming an exercise routine performed to music in squares, plazas or parks. It’s popular among mid-aged and retired women. They dance to a variety of music, mostly Chinese popular songs. There are also different kind of competitions for plaza dancing among different cities. [ ] What kind of sports do you like best?I like hiking a lot. I go hiking every two weeks. last week I went to Big Basin Redwood state park in Saratoga, California. Hiking is a really good way to stay healthy and fit, especially for people like me, who have to sit in front of computer and do programming five days a week. Also, the view there is terrific, fulfilling the scent of the nature, which makes me feel really relaxed. So even though it’s tiring, I really enjoy hiking. [ ] What are the benefits of doing sports?It’s a good way to relax myself. The stress of work and daily demands can distract us from what is actually meaningful and interesting. Taking a break from the daily hustle and bustle is essential for my mind to refresh, recharge and rejuvenate. It’s also beneficial for us to stay healthy and fit, especially for people like me, who have to sit in front of computer 5 days a week. What’s more, it’s also a good way to make new friends. [ ] How important is it for a person to have a hobby?it’s very essential for a person to have a hobby. A hobby is a good way to relax ourselves. The stress coming from work and daily demands can distract up from what is actually meaningful and interesting. Taking a break from the daily hustle and bustle is essential to our mind to refresh, recharge and rejuvenate. Also, having a hobby helps us make new friends. Birds with the same feather flock together. People with the same hobby can easily become good friends. So a hobby is a really important part of one’s life. [ ] Do you like swimming?I like swimming and I don’t know how to swim. When I was very little, one of my cousins died in a river when she went swimming. That accident left a shadow on my mind. From then on, I always feel dizzy when I get closed to rivers or swimming pool. In college, I took a swimming class but still, I do not know how to swim. [ ] Are bicycle popular in China?[ ] Has the number of bicycle riders in China changed much in the past few years?with the rapid development of the public transportation, more and more people are going for buses, subway or private cars. those ways are faster. [ ] What do you think the advantages and disadvantages of bicycles compared to cars?First, it’s very cost effective for sure. It’s just cost hundred of bucks to buy a bicycle and we do not need to pay insurance for it. Second, it’s really environment-friendly cause it does not produce exhaust at all. What’s more, we do not need to worry about being trapped in a traffic jam during rush hours. However, there are some bad sides of riding a bicycle. it’s too time-consuming and cannot going too far. If it’s raining or snowing, it’s really dangerous to ride a bicycle. [ ] When did you learn to ride a bike?I learnt how to ride a bike when I was in middle school. My brother taught me how to ride it. My family did not have a car, so we always rode a bike to school and libraries or my cousin’s home. [ ] What can arts bring to children. Part 1 Introduction and interview[This part of the test begins with the examiner introducing himself or herself and checking the candidate’s identification. It then continues as an interview.]Let’s talk about your home town or village. What kind of place is it? What’s the most interesting part of your town/village? What kind of jobs do the people in your town/village do?Would you say it’s a good place to live? (Why?) Let’s move on to talk about accommodation. Tell me about the kind of accommodation you live in? How long have you lived there? What do you like about living there? What sort of accommodation would you most like to live in? Part 2 – Individual long turn*Candidate Task Card Describe something you own which is very important to you. You should say:where you got it from how long you have had it what you use it forand explain why it is important to you.You will have to talk about the topic for 1 to 2 minutes.You have one minute to think about what you’re going to say. You can make some notes to help you if you wish.Rounding off questions Is it valuable in terms of money? Would it be easy to replace? Part 3 – Two-way discussionLet’s consider first of all how people’s values have changed. What kind of things give status to people in your country? Have things changed since your parents’ time? Finally, let’s talk about the role of advertising. Do you think advertising influences what people buy?","link":"/2019/08/21/Speaking/"},{"title":"刷题LeetCode","text":"刷题LeetcodeSlidingWindow处理字符串类 159. Longest Substring with at most 2 Distinct CharactersGiven a string s , find the length of the longest substring t that contains at most 2 distinct characters.Example 1:Input: “eceba”Output: 3Explanation: t is “ece” which its length is 3. Example 2:Input: “ccaabbb”Output: 5Explanation: t is “aabbb” which its length is 5. class Solution { public int lengthOfLongestSubstringTwoDistinct(String s) { char[] arr = s.toCharArray(); int n = arr.length; Map&lt;Character, Integer&gt; map = new HashMap&lt;&gt;(); int start = 0; int max = 0; for(int i = 0; i &lt; n; ++i){ map.put(arr[i], i); if(map.size() &gt; 2){ max = Math.max(i - start, max); // reassign max if(map.get(arr[start]) &lt;= start) // expired map.remove(arr[start]); start++; } } return Math.max(n - start, max); }} 904. Fruit into Baskets340. Longest Substring with At Most K distinct Characters424. Longest Repeating Character Replacement","link":"/2019/08/11/LeetCode/"},{"title":"bar-chart","text":"Bar chart (1) The bar graph shows the global sales (in billions of dollars) of different types of digital games between 2000 and 2006. The bar chart compares the worldwide turnover for four kinds of digital games from 2000 to 2006. Overall, sales of most games experienced an upward trend, except for console games.It is also noticeable that handheld games had by far the highest number of sales throughout the whole period. Looking at the information in more detail, the sales figure for handheld games was close to 10 billion dollars in 2000,this figure rose gradually to reach its peak at slightly under 18 billion dollars.By contrast, at 6 billion dollars sales figure, console games were the second most popular games in year 2000.Between 2000 and 2006, this figure continued to drop to hit its lowest point of less than 3 billion dollars. Global sales for online games and mobile phone games followed a similar pattern with both sales numbers went up considerably from 2002.By the seventh year, sales revenues for both types of games stood over 6 billion dollars. (2) The chart below shows global sales of the top five mobile phone brands between 2009 and 2013. The chart compares the number of mobile phones (that were) sold worldwide by the five most popular manufactures in the year 2009, 2011 and 2013. It is clear that Nokia sold the most mobiles phones between 2009 and 2011, but Samsung became the best seller in 2013.Samsung and Apple saw the biggest rises in sales over the 5-year period. In 2009, Nokia sold close to 450 million mobile phones, which was almost double the number of handsets sold by the second most successful manufacturer, Samsung. Over the following four years, however, Nokia’s sales figures fell by approximately 200 million units, whereas Samsung saw a sales rise by a similar amount. By 2013, Samsung had become the market leader, with sales reaching 450 million units. The other three top selling mobile phone brands between 2009 and 2013 were LG, ZTE and Apple.In 2009, these companies sold around 125 million, 50 million and 25 million mobile handsets respectively, but Apple overtook the other two vendors in 2011. In 2013, purchases of Apple handsets reached 150 million unites, while LG saw declining sales and the figures for ZTE rose slightly. The chart compares the five most popular manufactures in terms of the overall number of mobile phones they had sold worldwide in the year 2009, 2011 and 2013. Overall, Nokia sold the most mobiles phones between 2009 and 2011, but Samsung became the best seller in 2013.It is also noticeable that Samsung and Apple saw the biggest rises in sales over the five-year period. Looking at the information in more detail, Nokia sold close to 450 million mobile phones, which was almost the total number of handsets sold by Samsung, Apple, LG and ZTE combined. Over the following four years, however, Nokia’s sales figures fell by approximately 200 million units, whereas Samsung saw a sales rise by a similar amount. By 2013, Samsung had became the market leader, with sales reaching 450 million units. The other three top selling mobile phone brands between 2009 and 2013 were LG, ZTE and Apple.In 2009, these companies sold around 125 million, 50 million and 25 million mobile handsets respectively, but Apple overtook the other two vendors in 2011. In 2013, purchases of Apple handsets reached 150 million unites, while LG saw declining sales and the figures for ZTE rose slightly. (3) The chart below shows the total number of Olympic medals won by twelve different countries. The bar graph compares twelve countries in terms of the overall number of medals that they have won at the Olympic Games. Overall, US has by far won the most number of medals, while Japan won the least.It is also noticeable that the figures for gold, silver and bronze medals won by the rest of countries tend to be fairly similar. Looking at the information in more detail, the USA attained a total of around 2300 medals, including approximately 900 gold medals, 750 silver and 650 bronze. By contrast, with only around 300 units, Japan ranked the last.Soviet Union ran second just after America, at 1000 medals that included over 400 gold prizes, compared to approximately 150 units of UK. Germany, Italy, Sweden and Hungary obtained almost similar numbers of medals, with around 500 units for each country.There were higher quantities of medals for UK and France, which reached over 600 units.","link":"/2019/08/20/bar-chart/"},{"title":"diagram-comparison","text":"2 diagram-comparing 对比图before and after mapstwo alternative designstwo alternative locations on a map (1) The diagrams below show how houses can be protected in areas which are prone to flooding. The diagrams show two ways of building the houses to avoid being flooded. The most noticeable difference is that they show flood protection with and without a stopbank.The methods can also be compared in terms of the height of stilts. Looking at the information in more detail, the stopbank in the first diagram plays an important role in stopping river water from flooding homes. The stopbank is a mound of land next to the river that is higher than the 100-year flood level and acts as a flood barrier. If the internal ponding is higher than the potential flood level, then a floodgate beneath the stopbank can be opened to allow this pondeing to drain off into the river. Nearby houses are also built on stilts to prevent flooding from rainwater. When there is no stopbank, as shown in the second diagram, there will be nothing to stop the river from flooding. In this case, the solution is to put buildings on higher stilts. The height of the stilts is measured so that the floor of the house is 300mm above the 100-year flood level. This measurement is called the ‘freeboard’. (2) The map below is of the town of Garlsdon. A new supermarket (S) is planned for the town. The map shows two possible sites for the supermarket. The map shows two potential locations (S1 and S2) for a new supermarket in a town called Garlsdon. The most noticeable difference between the two sites is that S1 is outside the town, whereas S2 is in the town centre.The sites can also be compared in terms of access by road or rail, and their positions relative to three smaller towns. Looking at the information in more detail, S1 is in the countryside to the north west of Garlsdon, but it is still close to the residential area of the town. S2 is also near the housing area, which surrounds the town centre. There are main roads from Garlsdon town centre to Hindon, Bransdon and Cransdon, but this is a no traffic zone, so there would be no access to S2 by car. By contrast, S1 lies on the main road to Hindon, but it would be more difficult to reach from Bransdon and Cransdon. Both supermarket sites are close to the railway that runs through Garlsdon from Hindon to Cransdon. (3) The diagrams below show some principles of house design for cool and for warm climates. The diagrams show how house designs differ according to climate. The most noticeable difference is the shape of the roof.The designs also differ with regard to the windows and the building materials. Looking at the information in more detail, the cool climate house has a high-angled roof, which allows sunlight to enter through the window. By contrast, the roof of the warm climate house has a peak in the middle and the roof overhangs to shade the windows. Secondly, the cool climate house only has windows on one side which faces the direction of the sun, while the warm climate house has windows on both sides which are shaded from the sun. By opening the windows at night, the house designed for the warm house can be ventilated. Finally, insulation and thermal building materials are used in cool climates to reduce heat loss, whereas insulation and reflective materials are used to keep heat out in cool climates. (4) The diagrams below show the existing ground floor plan of a house and a proposed plan for some building work. Simon 范文The two pictures compare the current layout of the ground floor of a house with a plan to redesign the same living space. We can see that the new design proposal involves making a number of changes to the ground floor of the house, mainly in the central hall area. There are no plans to change external walls or entrances. (missing parts)The most noticeable change from the existing to the proposed floor plan is that there will no longer be a separate hall area when the building work has been done. This will be achieved by removing the internal wall and door between the hall and the living room, along with the current staircase and under-stair storage cupboard. With no separate hall area, the proposed living room will also contain the staircase to the first floor. (adding parts)To replace the curent staight staircase, a new set of windowing stairs will be installed in the corner of the living room. The internal door between the hall and the kitchen will also be replaced with double doors connecting the kitchen with the new living room. Finally, the planned building work will also include the installation of some kitchen furniture. Practice by EmmaThe two pictures compare the layout of the ground floor of a house, with a plan for some extra construction work. The most noticeable differnce is the central hall area between the kitch and the living room.The strutures can also be compared in terms of kitchen area and the storage place under the original stairs.The external walls or entrances will stay the same at this point. Looking at the information in more detail, in the first picture, a new set of rotative staircases will be installed in the top left corner of the living room instead.","link":"/2019/08/20/diagram-comparison/"},{"title":"diagram-process","text":"Process diagram流程图: natural cycles: water cycle, life cyle of a butterfly, paper recycle, glass recycling processmaps showing growth of a city (1) The diagrams below show how glass containers, such as bottles, are produced and recycled. The first flow diagram illustrates the process of glass container production, and the second diagram shows steps in the process of recycling used glass. We can see that glass is made using three main raw materials, and that the manufacturing process consists of four distinct stages. It requires five steps to turn used glass into new glass products. At the first stage in the production of glass, sand, soda ash, limestone and other chemicals are mixed together.Next, this mixture is heated in a glass furnace at approximately 1500C to produce molten glass.The molten glass can then be shaped by blowing, to create the end products, namely glass containers. Glass recycling begins with the collection of used glass products. The collected glass it sorted according to its color, and then washed in order to remove any impurities. At the fourth stage of recycling, the glass is crushed and melted, and the resulting molten glass can finally be moulded to create new items. The diagrams illustrates the process of producing and recycling glasses. Overall, this mixture is heated in a glass furnace at approximately 1500C until melting in the glass furnace. (2) The diagram below shows how solar panels can be used to provide electricity for domestic use. The procedure diagram describe the process of producing domestic electricity using sun panels.It is clear that there are five distinct components involved in this system, from the capture of energyfrom sunlight to the electricity distribution to every single home. To begin with, solar panels on the roof of a house take the energy from the sun and convert itto DC current.Next, this current is passed into the inverter, which turns it into AC current and regulate the supply of electricity.At stage three, the electricity is distributed into each residential through electrical panel. The final two steps show how domestic electricity is connected to the external power supply.At the fourth stage shown on the diagram, a utility meter is responsible for sending extra solar electricity backinto the grid. On the other hand, if the solar panels could not provide enough electricity forthe household, electricity will flow from the grid into the home through the meter. (3) The diagram shows the life cycle of the honey bee. The procedure diagram illustrates the various stages in the life of a honey bee.The complete life cycle lasts between 34 and 36 days.It is also noticeable that there are five main stages in the development of the honey bee, from eggs to mature adult insects. To begin with, typically 1 or 2 eggs are laid every three days by the adult female bees.After 9 or 10 days, each egg hatches and nymph appears. During the third stage, the nymph grows in size and sheds its skin for a total of three times. This moulting first takes place 5 days after the egg hatches, then 7 days, and again another 9 days. The final two steps show how the young adult honey bees become the mature adults.When the final moulting stage finishes, the young adult honey bee emerges.Just only 4 days later it reaches full maturity and the new life cycle starts. (4) The chart below shows the process of waste paper recycling. The flow chart illustrates the process of recycling waste paper.It is clear that there are six distinct stages in this system, from the initial collection of waste paper to the eventual production of usable paper. To begin with, the waste paper is gathered either from the public paper banks or directly from businesses. Next, the paper will be sorted by hand and separated acoording to its grade, with any paper that is not suitable for recyling being removed. The third stage is responsible for transporting the graded paper to the paper mill. The following two stages show how the collected paper is cleaned.During the fourth stage, the paper is cleaned, pulped and the other objects such as staples are taken out.Following this, all remnants of ink and glue are removed from the paper at the de-inking stage. Finally, with the help of the paper making machine, the end product-usable paper-is made. (5) The diagram below shows the water cycle, which is the continuous movement of water on, above and below the surface of the Earth. The picture illustrates that water passes from ocean to air to land during the natural process known as water cycle. It is clear that there are three distinct stages during this cycle, from the initial ocean water evaporation to the eventual back flow of water to the sea. To begin with, the heat from the sun causes water to evaporate. As shown on the diagram, 80 percent of water vapor comes from the oceans. When the water vapor becomes condensed enough, clouds form in the sky. Next, during the precipitation stage, clouds turn into either rain or snow. The last stage shows how water runs from ground back into the earth.Both the snow-thawing water and rainwater may take various paths. Some of it return to the oceans via “surface runoff”. Otherwise, rainwater may filter through the ground, reaching the impervious layer of the earth. Salt water intrusion takes place just before groundwater passes into the oceans, which is when the cycle is complete (6) Australian Bureau of Meteorology collects up-to-the-minute information on the weather. The picture illlustrates the process used by Australian Bureau of Meteorology to forecast the weather.There are 4 main stages in the system, from the initial weather information gathering to the eventual broadcast. Looking at the first two stages in the process, there are three ways of collecting weather data and three ways of analyzing it.To begin with, incoming information is received from the outer space, on land or at sea, using satellite, radar and drifting buoy respectively.Next, all the data is mapped on screen, chart, and photo for further analysis and forecasting. The following two stages shows how the weather data reaches the public.Stage three of the process is when the information is put in order and prepared for broadcast. This is done through computer which sends all necessary data to the fourth stage.At this point, the weather data is delivered (released) to the general public on TV, on the radio or as a recorded telephone announcement.","link":"/2019/08/20/diagram-process/"},{"title":"pie-chart","text":"Pie Chart (1) The pie charts below show how dangerous waste products are dealt with in three countries. The charts compares the ways to process dangerous waste product in three countries. Overall, the majority of dangerous products are buried underground in UK and Sweden.By contrast, most hazardous materious in the Republic of Korea are recycled. Looking at the information in more detail, 82 percent of the UK’s dangerous waste is put into the landfill sites. The same disposal technique is used for 55% of harmful waste in Sweden and only 22% of similar waste in Korea. The later country recycles 69% of hazardous materials, which is far more than the other two countries. While 25% of Sweden’s dangerous waste is recycled, the UK does not recycle at all. Instead, it dumps waste at sea or treats it chemically. These two methods are not employed in Korea or Sweden, which apply incineration for 9% and 20% of dangerous waste respectively. (2) The charts below show the results of a questionnaire that asked visitors to the Parkway Hotel how they rated the hotel’s customer service. The same questionnaire was given to 100 guests in the years 2005 and 2010. The pie charts compares visitors’ responses to a survey about custom service at the Parkway Hotel in 2005 and in 2010. Overall, the customer satisfaction increased considerably from 2005 to 2010.It is also noticeable that the majority of people rated customer service as excellent or good in the year 2010, while most people described the hotel’s service as poor or just satisfactory in 2005. Looking at the information in more detail, only 5% of the hotel’s visitors rated its customer service as excellent in 2005. This figure rose to 28% in 2019. While only 14% of guests described customer service in the hotel as good in 2005, almost three times as many people gave this rating five years later. With regard to negative feedback, the proportion of guests who considered the hotel’s customer service to be poor fell from 21% in 2005 to only 12% in 2010. Similarly, the proportion of people who thought customer service was very poor dropped from 15% to only 4% over the 5-year period. a fall in the number of ‘satisfactory’ ratings in 2010 reflects the fact that more people gave positive responses to the survey in that year. (3) The charts below show household spending patterns in two countries between 1980 and 2008. The pie charts compare five categories of household expenditure in the years 1980 and 2008. It is noticeable that the proportion of spending on food and drink fell in both countries over the 28-year period, while spending on utility bills rose. Also, UK residents spent a significantly budgets on leisure than their New Zealand counterparts. The pie charts compare household expenditure for 5 distinct categories between the UK and New Zealand in the years 1980 and 2008.","link":"/2019/08/20/pie-chart/"},{"title":"line-graph","text":"Line graph: compare the lines, not describe them separately （1) The graph below shows electricity production (in terawatt hours) in France between 1980 and 2012. The line graph compares (the amount of) electricity produced by France (using four sources of power) over a period of 32 years. It is clear that nuclear power was by far the most important means of electricity generation over the period shown. Renewables provided the lowest amount of electricity in each year. In 1980, thermal power stations were the main source of electricity in France, generating around 120 terawatt hours of power. Nuclear and hydroelectric power stations produced just under 75 terawatt hours of electricity each,and renewables provided a negligible amount.Just one year later, nuclear power overtook thermal power as the primary source of electricity. Between 1980 and 2005, electricity production from nuclear rose dramatically to a peak of 430 terawatt hours. By contrast, this figure for thermal power fell to only 50 terawatt hours in 1985, and remained at this level for the rest of the period. Hydroelectric power generation remained relatively stable, at between 50 an 80 terawatt hours, for the whole 32-year period, but renewable electricity production saw only a small rise to approximately 25 terawatt hours by 2012. The line graph compares (the amount of) electricity produced in France using four distinct sources of powers over a period of 32 years. Overall, the nuclear power was by far the main way of electricity generation over the period shown.It is also noticeable that renewables contributed the lowest amount of electricity in each of these years. Looking at the information in more detail, In 1980, thermal power stations were the main source of electricity in France, generating around 120 terawatt hours of power.Nuclear and hydroelectric power stations produced just under 75 terawatt hours of electricity each,and renewables provided a negligible amount.Just one year later, nuclear power overtook thermal power as the primary source of electricity. Between 1980 and 2005, electricity production from nuclear power rose gradually to reach its peak at 430 terawatt hours.By contrast, the figure for thermal power fell to only slightly over 50 terawatt hours in 1985, and remained at this level for the rest of the period.Hydroelectric power generation remained relatively stable, at between 50 an 80 terawatt hours, for the whole 32-year period,but renewable electricity production saw only a small rise to approximately 25 terawatt hours by 2012. you cannot write: 1. nuclear was 75 terawatt hours of electricity 2. nuclear produced 75 terawatt hours of electricity you can write: 1. nuclear power was used to produce 75 terawatt hours of electricity 2. nuclear power stations produced 75 terawatt hours of electricity ---","link":"/2019/08/20/line-graph/"},{"title":"","text":"w2 模板it is more important to do sth == I would welcome a greater emphasis on sthas opposed to == compared to == instead of == rather thanI believe == I would arguea rich variety offor a range of reasonsbenefit sb = are beneficial forcreate an attitude -&gt; foster an attitudehelp -&gt; supervise and supportfinancial supportwork together == group work == colaborate == co-operateeither orbothbutsuch asinsteadtackle == deal with == solveon the one hand, on the other handit seems to me that, I believe that, I would argue that, my view is that (From my point of view 非正式), in my opinionin some countries == in some parts of the worldtend toignoring the fact thatwhenifdefinitely == no doubtplay an important roleunless,figurepublic figures == celebrity == famous peopleaccustomed to == used toface discipline problemsface a range of considerationsa variety of = a range ofhave a responsibility to do sththe view that should be promoted. discussion opinion现象描述. I completely agree with the idea that xxx, and that xxx. There are several reasons why xxx.Firstly,Secondly,Finally,For example (For instance is informal), I believe that sth1 should go to sth2 instead.it is much cheaper to do sth.Furthermore (Also),For example/ Such as,If In conclusion, my view is that problem and solution Two-part question plays a central/important role infeel fulfilled professionally while a rich variety of factors may lead to job satisfaction, it would be unrealistic to expect everyone to be happy at work.could be lifted out of poverty. given a better quality of life. 论点考虑：(1) 时间time saving，(2) 物质上：金钱money cheaper, expensive, come at a huge cost to(3) 工作 career， job interviews, job fair, adult life(4) a great source of motivation for sb. encourage sb to work harder to outdo other pupils(5) 精神上：自信心的建立 help to build sb’s self confidence(6) 政治上：politician, vanity projectsvanity projects for politicians.Have a positive impact on sb.论点之内逐步递进关系 当谈到对立面的时候用on one hand, on the other hand Firstly, Secondly, Finally, For example in conclusion career opportunity There are several reasons why I would argue against having compulsory community service for secondary school students.Firstly, the school curriculum is already full with import academic subjects, such as math, science and languages.For example, I remember haviing an extremely busy timetable when I was at high school, and it would not have been possible to add to it.Secondly, student’s performance in other subjects would be affected if valuable study time were taken by charity work or neighbourhood improvement schemes.Finally, I believe that teenage students would be reluctant to take part in any programme of obligatory work and this could lead to poor motivation and even bad behaviour.","link":"/2019/08/18/w2模板/"},{"title":"table","text":"Table (1) The table below shows the amount of waste production (in millions of tonnes) in six different countries over a twenty-year period. The chart compares the amounts of wastes that were produced in six countries in the year 1980, 1990 and 2000. Overall, in each of these years, the US produced more waste than Ireland, Japan, Korea, Poland and Portugal combined.It is also noticeable that Korean was the only country that managed to reduce its waste output by the year 2000. Looking at the information in more detail, between 1980 to 2000, waste production in the US rose from 131 to 192 millions of tones, and rising trends were also seen in Japan, Poland and Portugal. Japan’s waste output increased from 28 to 53 millions of tones, while Poland and Portugal saw waste totals increase from 4 to 6.6 and from 2 to 5 respectively. The trends for Ireland and Korea were noticeably different from those described above. In Ireland, waste production increased more than eightfold, from only 0.6 million tonnes in 1980 to 5 million tonnes in 2000. Korea, by contrast, cut its waste output by 12 million tonnes between 1990 and 2000. (2) The table below shows changes in the numbers of residents cycling to work in different areas of the UK between 2001 and 2011. The chart compares the number of people who cycled to work in twelve areas of US in the year 2001 and 2011. Overall, the number of UK commuters who travelled to work by bicycle rose considerably over the 10-year period. Inner London has by far the highest number of cycling commuters in both years. Looking at the information in more detail, in 2001, over 43 thousand residents of inner London commuted by bicycle, and this figure rose to more than 106 thousand in 2011, an increase of 144%. By contrast, although outer London had the second highest number of cycling commuters in each year, the percentage change, at only 45%, was the lowest of the twelve areas shown in the table. Brighton and Hove saw the second biggest increase (109%) in the number of residents cycling to work, while Bristol was the UK’s second city in terms of total numbers of cycling commuters, with 8,108 in 2001 and 15,768 in 2011. Figures for the other eight areas were below the 10 thousand mark in both years. (3) Percentage of mobile phone owners using various mobile phone features The table shows the percentage of people using different functions of their mobile phones in the year 2006, 2008 and 2010. Overall, the main reason why people used their mobile phones was to make phone calls.It is also noticeable that a marked increase was seen in the popularity of other phone features, particularly the internet search feature. Looking at the information in more detail, between 2006 and 2010, around 100% people used their mobile to make phone calls. The next most popular functions were text messaging (73%) and taking photos (66%). Over the following 4 years, there was relatively little change in the figures for the top three mobile phone features. However, the percentage of people using their phones to access the Internet jumped to 41% in 2008 and then to 73% in 2010. There was also a significant rise in the use of mobiles to play games and record video, with figures reaching 41 percent and 35 percent respectively. (4) the table below shows statistics about the top five countries for international tourism in 2012 and 2013. The table compares the five highest ranking countries in terms of the number of visits and the money spent by the tourists over a period of two years. Overall, France was the world’s most popular tourist destination in the years 2012 and 2013.It is also noticeable that the USA earned by far the most revenue from tourism over the same period. Looking at the information in more detail, In 2002, 83 million tourists visited France, and the USA was the second most visited country, with 66.7 million tourists.Spain and China each received justed under 58 million visitors, while Italy was ranked fifth with 46.4 million tourists.2013 saw a rise of between 1 and 4 million tourist visits to each country, with the exception of China, which received 2 million fewer visitors than in the previous year. Spending by tourists visiting the USA increased from $126.2 million in 2002 to $139.6 billion in 2013, and these figures were well over twice as high as those for any other country. Spain received the second highest amounts of tourist revenue, rising from $56.3 billion to $60.4 billion, followed by France, China and Italy. Interestingly, despite falling numbers of tourists, Chinese revenue from tourism rose by $1.7 billion in 2013. (5) The table below gives information on consumer spending on different items in five different countries in 2002. The chart shows the percentage of consumer expenditure for three categories of products in five countries during the year 2002. Overall, the largest proportion of consumer spending in each country went on food, drinks and tobacco.On the other hand, the leisure/education category has the lowest percentages in the table. Looking at the information in more detail, consumer spending on food, drinks and tobacco was noticeably higher in Turkey, at 32.14%, and Ireland, at nearly 29%. The proportion of spending on leisure and education was also highest in Turkey, at 4.35%. By contrast, expenditure on clothing and footwear was significantly higher in Italy, at 9%, than in any of the other countries. It is also noticeable that Sweden had the lowest percentages of national consumer expenditure for food/drinks/tobacco and for clothing/footwear, at nearly 16% and just around 5% respectively. Spain had slightly higher figures for these categories, but the lowest figure for leisure/education, at only 1.98%. (6) The table below shows the proportion of different categories of families living in poverty in Australia in 1999. The table gives information about poverty rates among six types of household in Australia during the year of 1999. Overall, the level of poverty were higher for single people than for couples. and people with children were more likely to be poor than those without.It is also noticeable that poverty rates were considerably lower among elderly people. Looking at the information in more detail, 11% of Australians, or 1,837,000 people, were living in poverty in 1999. Over one fifth of single parents were living in poverty， whereas only 12% of parents living with a partner were classed as poor. The same pattern can be seen for people with no children: while 19% of single people in the group were living below the poverty line, the figure for couples was much lower, at only 7%. Also, Aged people were the least likely to be poor, with poverty levels of 6% and 4% for single aged people and aged couples respectively. (7) The table below gives information about the underground railway systems in six cities. The chart compares the six networks in terms of their age, size and the number of people who use them each year. Overall, the three oldest underground systems are larger and serve significantly more passengers than the newer systems. It is also noticeable that the usage rate of Washington DC one was the lowest considering its size and passengers per year. Looking at the information in more detail, the London underground is the oldest opened in 1863. It’s also the largest system, with 394 kilometres of route. The second largest system, in Paris, is only about half the size of the London underground, with 199 kilometres of route. However, it serves more people per year. While only third in terms of size and age, the Tokyo system is easily the most used, with 1927 million passengers per year. Of the three newer networks, the Washington DC underground is the most extensive, with 126 kilometres of route, compared to only 11 kilometres and 28 kilometres for the Kyoto and Los Angeles systems respectively. The Los Angeles network is the newest, having opened in 2001, while the Kyoto network is the smallest and serves only 45 million passengers per year.","link":"/2019/08/20/table/"},{"title":"IELTS(A)","text":"雅思A类 WritingWriting小作文1 diagram - process 流程图 2 diagram-comparing 对比图 3 Table (1) The table below shows the amount of waste production (in millions of tonnes) in six different countries over a twenty-year period. The chart compares the amounts of wastes that were produced in six countries in the year 1980, 1990 and 2000. Overall, in each of these years, the US produced more waste than Ireland, Japan, Korea, Poland and Portugal combined.It is also noticeable that Korean was the only country that managed to reduce its waste output by the year 2000. Looking at the information in more detail, between 1980 to 2000, waste production in the US rose from 131 to 192 millions of tones, and rising trends were also seen in Japan, Poland and Portugal. Japan’s waste output increased from 28 to 53 millions of tones, while Poland and Portugal saw waste totals increase from 4 to 6.6 and from 2 to 5 respectively. The trends for Ireland and Korea were noticeably different from those described above. In Ireland, waste production increased more than eightfold, from only 0.6 million tonnes in 1980 to 5 million tonnes in 2000. Korea, by contrast, cut its waste output by 12 million tonnes between 1990 and 2000. (2) The table below shows changes in the numbers of residents cycling to work in different areas of the UK between 2001 and 2011. The chart compares the number of people who cycled to work in twelve areas of US in the year 2001 and 2011. Overall, the number of UK commuters who travelled to work by bicycle rose considerably over the 10-year period. Inner London has by far the highest number of cycling commuters in both years. Looking at the information in more detail, in 2001, over 43 thousand residents of inner London commuted by bicycle, and this figure rose to more than 106 thousand in 2011, an increase of 144%. By contrast, although outer London had the second highest number of cycling commuters in each year, the percentage change, at only 45%, was the lowest of the twelve areas shown in the table. Brighton and Hove saw the second biggest increase (109%) in the number of residents cycling to work, while Bristol was the UK’s second city in terms of total numbers of cycling commuters, with 8,108 in 2001 and 15,768 in 2011. Figures for the other eight areas were below the 10 thousand mark in both years. (3) Percentage of mobile phone owners using various mobile phone features The table shows the percentage of people using different functions of their mobile phones in the year 2006, 2008 and 2010. Overall, the main reason why people used their mobile phones was to make phone calls.It is also noticeable that a marked increase was seen in the popularity of other phone features, particularly the internet search feature. Looking at the information in more detail, between 2006 and 2010, around 100% people used their mobile to make phone calls. The next most popular functions were text messaging (73%) and taking photos (66%). Over the following 4 years, there was relatively little change in the figures for the top three mobile phone features. However, the percentage of people using their phones to access the Internet jumped to 41% in 2008 and then to 73% in 2010. There was also a significant rise in the use of mobiles to play games and record video, with figures reaching 41 percent and 35 percent respectively. (4) the table below shows statistics about the top five countries for international tourism in 2012 and 2013. The table compares the five highest ranking countries in terms of the number of visits and the money spent by the tourists over a period of two years. Overall, France was the world’s most popular tourist destination in the years 2012 and 2013.It is also noticeable that the USA earned by far the most revenue from tourism over the same period. Looking at the information in more detail, In 2002, 83 million tourists visited France, and the USA was the second most visited country, with 66.7 million tourists.Spain and China each received justed under 58 million visitors, while Italy was ranked fifth with 46.4 million tourists.2013 saw a rise of between 1 and 4 million tourist visits to each country, with the exception of China, which received 2 million fewer visitors than in the previous year. Spending by tourists visiting the USA increased from $126.2 million in 2002 to $139.6 billion in 2013, and these figures were well over twice as high as those for any other country. Spain received the second highest amounts of tourist revenue, rising from $56.3 billion to $60.4 billion, followed by France, China and Italy. Interestingly, despite falling numbers of tourists, Chinese revenue from tourism rose by $1.7 billion in 2013. (5) The table below gives information on consumer spending on different items in five different countries in 2002. The chart shows the percentage of consumer expenditure for three categories of products in five countries during the year 2002. Overall, the largest proportion of consumer spending in each country went on food, drinks and tobacco.On the other hand, the leisure/education category has the lowest percentages in the table. Looking at the information in more detail, consumer spending on food, drinks and tobacco was noticeably higher in Turkey, at 32.14%, and Ireland, at nearly 29%. The proportion of spending on leisure and education was also highest in Turkey, at 4.35%. By contrast, expenditure on clothing and footwear was significantly higher in Italy, at 9%, than in any of the other countries. It is also noticeable that Sweden had the lowest percentages of national consumer expenditure for food/drinks/tobacco and for clothing/footwear, at nearly 16% and just around 5% respectively. Spain had slightly higher figures for these categories, but the lowest figure for leisure/education, at only 1.98%. (6) The table below shows the proportion of different categories of families living in poverty in Australia in 1999. The table gives information about poverty rates among six types of household in Australia during the year of 1999. Overall, the level of poverty were higher for single people than for couples. and people with children were more likely to be poor than those without.It is also noticeable that poverty rates were considerably lower among elderly people. Looking at the information in more detail, 11% of Australians, or 1,837,000 people, were living in poverty in 1999. Over one fifth of single parents were living in poverty， whereas only 12% of parents living with a partner were classed as poor. The same pattern can be seen for people with no children: while 19% of single people in the group were living below the poverty line, the figure for couples was much lower, at only 7%. Also, Aged people were the least likely to be poor, with poverty levels of 6% and 4% for single aged people and aged couples respectively. (7) The table below gives information about the underground railway systems in six cities. The chart compares the six networks in terms of their age, size and the number of people who use them each year. Overall, the three oldest underground systems are larger and serve significantly more passengers than the newer systems. It is also noticeable that the usage rate of Washington DC one was the lowest considering its size and passengers per year. Looking at the information in more detail, the London underground is the oldest opened in 1863. It’s also the largest system, with 394 kilometres of route. The second largest system, in Paris, is only about half the size of the London underground, with 199 kilometres of route. However, it serves more people per year. While only third in terms of size and age, the Tokyo system is easily the most used, with 1927 million passengers per year. Of the three newer networks, the Washington DC underground is the most extensive, with 126 kilometres of route, compared to only 11 kilometres and 28 kilometres for the Kyoto and Los Angeles systems respectively. The Los Angeles network is the newest, having opened in 2001, while the Kyoto network is the smallest and serves only 45 million passengers per year. Pie Chart (1) The pie charts below show how dangerous waste products are dealt with in three countries. The charts compares the ways to process dangerous waste product in three countries. Overall, the majority of dangerous products are buried underground in UK and Sweden.By contrast, most hazardous materious in the Republic of Korea are recycled. Looking at the information in more detail, 82 percent of the UK’s dangerous waste is put into the landfill sites. The same disposal technique is used for 55% of harmful waste in Sweden and only 22% of similar waste in Korea. The later country recycles 69% of hazardous materials, which is far more than the other two countries. While 25% of Sweden’s dangerous waste is recycled, the UK does not recycle at all. Instead, it dumps waste at sea or treats it chemically. These two methods are not employed in Korea or Sweden, which apply incineration for 9% and 20% of dangerous waste respectively. (2) The charts below show the results of a questionnaire that asked visitors to the Parkway Hotel how they rated the hotel’s customer service. The same questionnaire was given to 100 guests in the years 2005 and 2010. The pie charts compares visitors’ responses to a survey about custom service at the Parkway Hotel in 2005 and in 2010. Overall, the customer satisfaction increased considerably from 2005 to 2010.It is also noticeable that the majority of people rated customer service as excellent or good in the year 2010, while most people described the hotel’s service as poor or just satisfactory in 2005. Looking at the information in more detail, only 5% of the hotel’s visitors rated its customer service as excellent in 2005. This figure rose to 28% in 2019. While only 14% of guests described customer service in the hotel as good in 2005, almost three times as many people gave this rating five years later. With regard to negative feedback, the proportion of guests who considered the hotel’s customer service to be poor fell from 21% in 2005 to only 12% in 2010. Similarly, the proportion of people who thought customer service was very poor dropped from 15% to only 4% over the 5-year period. a fall in the number of ‘satisfactory’ ratings in 2010 reflects the fact that more people gave positive responses to the survey in that year. Bar chart (1) The bar graph shows the global sales (in billions of dollars) of different types of digital games between 2000 and 2006. The bar chart compares the worldwide turnover for four kinds of digital games from 2000 to 2006. Overall, sales of most games experienced an upward trend, except for console games.It is also noticeable that handheld games had by far the highest number of sales throughout the whole period. Looking at the information in more detail, the sales figure for handheld games was close to 10 billion dollars in 2000,this figure rose gradually to reach its peak at slightly under 18 billion dollars.By contrast, at 6 billion dollars sales figure, console games were the second most popular games in year 2000.Between 2000 and 2006, this figure continued to drop to hit its lowest point of less than 3 billion dollars. Global sales for online games and mobile phone games followed a similar pattern with both sales numbers went up considerably from 2002.By the seventh year, sales revenues for both types of games stood over 6 billion dollars. (2) The chart below shows global sales of the top five mobile phone brands between 2009 and 2013. The chart compares the number of mobile phone sold worldwide by the five most popular manufactures in the years 2009, 2011 and 2013. It is clear that Nokia sold the most mobiles phone between 2009 and 2011, but Samsung became the best seller in 2013.It is also noticeable that Samsung and Apple saw the biggest rises in sales over the 5-year period. In 2009, Nokia sold close to 450 million mobile phones, which was almost double the number of handsets sold by the second most successful manufacturer, Samsung. Over the following four years, however, Nokia’s sales figures fell by approximately 200 million units, whereas Samsung saw a sales rise by a similar amount. By 2013, Samsung had become the market leader, with sales reaching 450 million units. The other three top selling mobile phone brands between 2009 and 2013 were LG, ZTE and Apple.In 2009, these companies sold (3) The chart below shows the total number of Olympic medals won by twelve different countries. The bar graph compares twelve countries in terms of the overall number of medals that they have won at the Olympic Games. Overall, US has by far won the most number of medals, while Japan won the least.It is also noticeable that the figures for gold, silver and bronze medals won by the rest of countries tend to be fairly similar. Looking at the information in more detail, the USA attained a total of around 2300 medals, including approximately 900 gold medals, 750 silver and 650 bronze. By contrast, with only around 300 units, Japan ranked the last.Soviet Union ran second just after America, at 1000 medals that included over 400 gold prizes, compared to approximately 150 units of UK. Germany, Italy, Sweden and Hungary obtained almost similar numbers of medals, with around 500 units for each country.There were higher quantities of medals for UK and France, which reached over 600 units. Line Graph The chartBy contrast, Writing大作文Argumentation： 给出一种观点–agree or disagree, Discuss both views and give your own opinions. 给出两种对立的观点–Discuss both views and give your own opinions. 分析优缺点——-Do you think the advantages/ benefits outweigh its disadvantages/ problems？ opinion：踩一捧一 (1) The money spent by governments on space programmes would be better spent on vital public services such as schools and hospitals. To what extent do you agree or disagree? Governments in some countries spent large amounts of money on space exploration programmes. I completely agree with the idea that these are a waste of money, and that the funds should be allocated to public services. There are several reasons why space programmes should be abandoned. Firstly, it is extremely expensive to train scientists and other staff involved with space missions, and facilities and equipments also come at a huge cost to the government. Secondly, these programmes do not benefit normal people in our daily basis; they are simply vanity projects for politicians. Finally, many missions to space fail completely, and the smallest technological error can cost astronauts their lives. For example, the Challenger Space Shuttle disaster showed us that space travel is extremely dangerous, and in my opinion it is not worth the risk. I believe that the money from space programmes should go to vital public services instead. It is much cheaper to train doctors, teachers, police and other public service workers than it is to train astronauts or the scientists and the engineers who work on space exploration projects. Furthermore, public services do jobs that have a positive impact on every member of society. For example, we all use schools, hospitals and roads, and we all need the security that the police provide. If governments reallocated the money spent on space travel and research, many thousands of people could be lifted out of poverty or given a better quality of life. In conclusion, my view is that it is wrong to waste resources on projects that do not improve our everyday lives, and governments should spent money on services that are beneficial for all members of society. Discussion：对比分析On the one hand, on the other hand (1) Some people think that a sense of competition in children should be encouraged. Others believe that children who are taught to co-operate rather than compete become more useful adults.Discuss both these views and give your own opinion. People have different views about whether children should be taught to be competitive or co-operative. While a spirit of competition can sometimes be useful in life, I believe that the ability to co-operate is more important. On the one hand, competition can be a great source of motivation for children. When teachers use prized to introduce an element of competitiveness into lessons, it can encourage children to work harder to outdo other pupils in the class. This kind of health rivalry may help to build children’s self confidence, while pushing them to work independently and progress more quickly. After these children leave school, their confidence and determination will help them in competitive situations such as job interviews. Therefore, it can be argued that competition should be encouraged in order to prepare children for adult life. On the other hand, it is perhaps more important to prepare children for the many aspects of the adult life that require co-operation. In the workplace, adults are expected to work in teams, follow instructions given by their superiors, or supervise and support the more junior members of staff. Team collaboration skills are much more useful than a competitive determination to win. This is the attitude that I believe schools should foster in young people. Instead of promoting the idea that people are either winners or losers, teachers should show children that they gain more from working together. In conclusion, I can understand why people might want to encourage competitiveness in children, but it seems to me that a co-operative attitude is much more desirable in adult life. problems &amp; solution (1) In many countries schools have severe problems with student behaviour, what do you think are the causes of this? what solutions can you suggest It is true that the behavior of school pupils in some parts of the world has been getting worse in recent years. There are a variety of possible reasons for this, but steps can definitely be taken to tackle the problem. In my opinion, three main factors are to blame for the way young people behave at school nowadays. Firstly, modern parents tend to be more lenient or permissive. Many children become accustomed to getting whatever they want, and they find it difficult to accept the demands of teachers or the limits imposed on them by school rules. Secondly, if teachers cannot control their students, there must be an issue with the quality of classroom management training or support within schools. Finally, children are influenced by the behavior of the celebrities, many of whom set the example that success can be achieved without finishing school. Student behavior can certainly improved. I believe that the change must start from parents, who need to be persuaded that it is important to set firm rules for their children. When children misbehave or break the rules, parents should use reasonable punishments to demonstrate that actions have consequences. Also, schools could play a important role in training both teachers and parents to use effective disciplinary techniques, and in improving the communication in both groups. At the same time, famous people, such as musicians and football players, need to understand the responsibility that they have to act as role models to children. In conclusion, school will continue to face discipline problems unless parents, teachers and public figures set clear rules and demonstrate the right behavior themselves. two-parts question(1) New editors decide what to broadcast on television and what to print in newspapers. what factors do you think influence these decisions? do we become used to bad news, and would it be better if more good news was reported? It is true that editors have to make difficult decisions about which news stories they broadcast or publish, and their choices are no doubt influenced by a variety of factors. In my opinion, we are exposed to a huge amount of bad news, and I would welcome a greater emphasis on good news. Editors face a range of considerations when deciding what new stories to focus on. Firstly, I imagine that they have to consider whether the viewers or readers will be interested enough to choose their television channel or their newspaper over competing providers. Secondly, news editors have a responsibility to inform the public about important events and issues, and they should therefore prioritize stories that are in the public interest. Finally, editors are probably under some pressure from the owners who employ them. For example, a newspaper owner might have particular political views that he or she wants to promote. (topic)It seems to me that people do become more accustomed to negative news. (example)We are exposed on a daily basis to stories about war, crime, natural disaster and tragic human suffering around the world. (result)I believe that such repeated exposure gradually desensitizes people, and we become more cynical about the world and more skeptical that we can do anything to change it. (alternative)I would prefer to see more positive news stories, such as reports of the work of medical staff after a natural disaster, or the kindness of volunteers who help in their communities. (result)This kind of news might inspire us all to lead better lives. In conclusion, it must be extremely difficult for editors to choose which news stories to present, but I would like to see a more positive approach to this vital public service. (1) Doing an enjoyable activity with a child can develop better skills and more creativity than reading.To what extent do you agree? Use reasons and specific examples to explain your answer. Parents throughout the world spend time reading with their offspring to prepare them for school where their literacy skills are further developed; however, recent research suggests that focusing on reading at an early age can be detrimental, and participating in fun activities would be far more beneficial. I am a strong advocate of this approach, and the benefits of it will be covered in this essay. A fundamental reason for this is that there is no biological age for reading, and pushing infants to acquire this skill before they are ready could have repercussions. For example, in the UK, many boys are reluctant readers, possibly because of being forced to read, and this turned them off reading. By focusing on other activities and developing other skills such as creativity and imagination, when they are ready to read, they usually acquire this skill rapidly. In addition, the importance of encouraging creativity and developing a child’s imagination must be acknowledged. Through play, youngsters develop social and cognitive skills, for example, they are more likely to learn vocabulary through context rather than learning it from a book. Furthermore, play allows youngsters to mature emotionally, and gain self-confidence. There is no scientific research which suggests reading at a young age is essential for a child’s development, moreover, evidence suggests the reverse is true. In Finland, early years’ education focuses on playing. Reading is only encouraged if a child shows and interest in developing this skill. This self-directed approach certainly does not result in Finnish school leavers falling behind their foreign counterparts. In fact, Finland was ranked the sixth best in the world in terms of reading. Despite being a supporter of this non-reading approach, I strongly recommend incorporating bedtime stories into a child’s daily routine. However, reading as a regular daytime activity should be swapped for something which allows the child to develop other skills. (2) Today, the quality of life in large cities is decreasing. Discuss the causes and solutions. The global phenomenon of urbanisation from the beginning of industrialisation to the present day has brought opportunity and prosperity, albeit at a cost in the quality of life. With an increasing city population, the complexity of the challenges also increases, the causes and solutions for this are outlined below. The causes for the decrease in the quality of life are paradoxically the prosperity endowed on such metropolitan centres. Their growth is largely due to the increase of opportunities on offer, which in turn increases their attractiveness, essentially they are trapped in a positive self-reinforcing cycle. However, this eventually leads to a decrease in the quality of life as the city can experience overcrowding, exorbitant property prices, and increased vulnerability to terrorist attacks. For example the density of London makes it a more efficient place to attack, when compared to a smaller city such as Bradford. Therefore, due to continuous growth and prosperity, urban citizens, especially the less well off, often experience a lower standard of living. Considering the solutions, greater investment in public transport would ease traffic congestion, as would bike lanes. In theory this would reduce air pollution, and possibly improve the wellbeing of the population if they did adopt a more active lifestyle and cycle to work. To counter violent terrorist attacks, cities could embark on CCTV installations, so as to closely monitor for threats. For example, it is said, the CCTV in London has foiled many potential attacks, and therefore greatly increased the security of its citizens. To conclude, a wealthy city attracts a large population inflow, which then causes pressure on existing infrastructure and security. Various solutions exist to mitigate such drawbacks, nevertheless an indefinite solution has yet to be found. Social media marketing can influence what consumers buy. Do you agree or disagree? To what extent do you agree? Since the introduction of social media applications in the early 2000’s the world has become a much smaller place. Social media applications such as Facebook, Instagram and Twitter have become information sources for a majority of the global market. As such, I would agree that marketing, which happens to be a source of information accessible on these platforms can influence the consumers who use them. This notion is further aided by the rise in online retail stores who conduct the bulk of their transactions online. This makes it easier for the consumer to purchase from anywhere in the world. As a consumer on social media, you are constantly bombarded with advertisements of various products that are specifically designed to catch your attention. This means that most of the adverts on your news feeds aren’t random and will almost always feature something you have previously searched online or something currently popular or trending. Given the fact that most social media users are young consumers who are influenced by current trends and happenings these adverts will almost always catch their eye. The habit of sharing, retweeting and liking also ensures that these adverts get around, quite fast. As such, when an advert does reach your news feed you have already probably seen it on your friend’s news feed. The truth is, adverts are a form of information and with the age of the internet, information spreads faster than a wild fire. Therefore, it only makes sense that in the era and age of technology, globalization and the need to be trendy, social media marketing can influence what consumers buy. SpeakingSpeaking 1Speaking 2Speaking 3","link":"/2019/08/13/IELTS-A/"}],"tags":[],"categories":[]}